---
kind: method
id: M:Autodesk.Revit.DB.View.EnableRevealHiddenMode
zh: 视图
source: html/1e3fa28b-7738-ee26-f983-c9ebfb08f098.htm
---
# Autodesk.Revit.DB.View.EnableRevealHiddenMode Method

**中文**: 视图

Enables Reveal Hidden elements mode.

## Syntax (C#)
```csharp
public void EnableRevealHiddenMode()
```

## Exceptions
- **Autodesk.Revit.Exceptions.InvalidOperationException** - View cannot use temporary visibility modes.